GabyGold67/SevenSegDisplays_STM32/src/sevenSegDisplays.h
/**
  ******************************************************************************
  * @file	: SevenSegDisplays.h
  * @brief	: Header file for SevenSegDisplays library classes
  *
  * @details This library builds Seven Segments LEDs displays independently from the hardware involved to execute the display. The included attributes and methods are hardware implementation agnostic, the hardware used might be changed by design requirements, and several different hardware display models might be used at the same time with the same API even if they are based on different driver chips or management technologies.
  *
  * @author	: Gabriel D. Goldman
  * @version v1.0.0
  * @date	: Created on: 16/11/2023
  * 			: Last modification:	11/06/2024
  * @copyright GPL-3.0 license
  *
  ******************************************************************************
  * @attention	This library was developed as part of the refactoring process for an industrial machines security enforcement and control (hardware & firmware update). As such every class included complies **AT LEAST** with the provision of the attributes and methods to make the hardware & firmware replacement transparent to the controlled machines. Generic use attribute and methods were added to extend the usability to other projects and application environments, but no fitness nor completeness of those are given but for the intended refactoring project.
  * **Use this library is under your own responsibility**
  *
  ******************************************************************************
  */

#ifndef _SEVENSEGDISPLAYS_STM32_H_
	#define _SEVENSEGDISPLAYS_STM32_H_

#include "SevenSegDispHw.h"

#include <string>
//===========================>> Next lines included for developing purposes, corresponding headers must be provided for the production platform/s
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal_gpio.h"
//===========================>> Previous lines included for developing purposes, corresponding headers must be provided for the production platform/s

//===========================>> Next lines provided to use FreeRTOS and avoid CMSIS wrappers
#include "FreeRTOS.h"
#include "task.h"
#include "timers.h"
//#include "queue.h"
//#include "semphr.h"
//===========================>> Previous lines provided to use FreeRTOS and avoid CMSIS wrappers

// Maximum limit constants, those are provided just to avoid lack of resources errors in the testing stage. They might be changed to lower or higher values, as much as needed and as long as no lack of resources errors are triggered
const int MAX_DIGITS_PER_DISPLAY{16};
const int MAX_DISPLAYS_QTY{16};

//============================================================> Class declarations separator

/**
 * @brief Models seven segment display class objects.
 *
 * The class implements a hardware independent API for seven segment display objects. The data to be shown by the physical display, after generated, is stored and passed to the underlying hardware display.
 *
 * @class SevenSegDisplays
 */
class SevenSegDisplays {
    static uint8_t _displaysCount;
    static uint16_t _dspSerialNum;
    static uint8_t _dspPtrArrLngth;
    static SevenSegDisplays** _instancesLstPtr;

    static void tmrCbBlink(TimerHandle_t blinkTmrCbArg);
    static void tmrCbWait(TimerHandle_t waitTmrCbArg);
private:
    uint8_t _waitChar {0xBF};
    uint8_t _waitCount {0};
    bool _waiting {false};
    unsigned long _waitRate {250};
    unsigned long _waitTimer {0};
protected:
    const unsigned long _minBlinkRate{100};
    const unsigned long _maxBlinkRate{2000};

    bool _blinking{false};
    bool* _blinkMaskPtr{nullptr};
    bool _blinkShowOn{false};
    unsigned long _blinkOffRate{500};
    unsigned long _blinkOnRate{500};
    unsigned long _blinkRatesGCD{500};  //Holds the value for the minimum timer checking the change ON/OFF of the blinking, saving unneeded timer interruptions, and without the need of the std::gcd function.
    unsigned long _blinkTimer{0};
    TimerHandle_t _blinkTmrHndl{NULL};
    uint8_t* _dspAuxBuffPtr{nullptr};
    uint8_t* _dspBuffPtr{nullptr};
    uint8_t _dspDigitsQty{};
    SevenSegDispHw* _dspUndrlHwPtr{};
    SevenSegDisplays* _dspInstance;
    uint16_t _dspInstNbr{0};
    int32_t _dspValMax{};
    int32_t _dspValMin{};
    std::string _charSet{"0123456789AabCcdEeFGHhIiJLlnOoPqrStUuY-_=~* ."}; // for using indexOf() method
    uint8_t _charLeds[45] = {   //Values valid for a Common Anode display. For a Common Cathode display values must be logically bit negated
        0xC0, // 0
        0xF9, // 1
        0xA4, // 2
        0xB0, // 3
        0x99, // 4
        0x92, // 5
        0x82, // 6
        0xF8, // 7
        0x80, // 8
        0x90, // 9
        0x88, // A
        0xA0, // a
        0x83, // b
        0xC6, // C
        0xA7, // c
        0xA1, // d
        0x86, // E
        0x84, // e
        0x8E, // F
        0xC2, // G
        0x89, // H
        0x8B, // h
        0xF9, // I
        0xFB, // i
        0xF1, // J
        0xC7, // L
        0xCF, // l
        0xAB, // n
        0xC0, // O
        0xA3, // o
        0x8C, // P
        0x98, // q
        0xAF, // r
        0x92, // S
        0x87, // t
        0xC1, // U
        0xE3, // u
        0x91, // Y
        0xBF, // Minus -
        0xF7, // Underscore _
        0xB7, // Low =
        0xB6, //~ for Equivalent symbol
        0x9C, // °
        0xFF, // Space
        0x7F  //.
    };
    uint8_t _dot {0x7F};
    uint8_t _space {0xFF};
    std::string _spacePadding{""};
    TimerHandle_t _waitTmrHndl{NULL};
    std::string _zeroPadding{""};

    unsigned long blinkTmrGCD(unsigned long blnkOnTm, unsigned long blnkOffTm);
    void restoreDspBuff();
    void saveDspBuff();
    void setAttrbts();
    void updBlinkState();
    void updWaitState();

public:
    /**
     * @brief Class constructor
     *
     * @param dspUndrlHwPtr A pointer to the underlying hardware display, a SevenSegDispHw instantiable class object.
     *
     *  The underlying hardware display is the physical device used to display the information generated by this class objects, shared through it's buffer.
     *  As such the underlying display has physical properties that might condition some of this object's characteristics -some has no practical incidence- including:
     *  - Digits (ports) quantity.
     *  - Type of led connection (common Anode/common Cathode).
     *  - Turn On/Turn Off control
     *  - Quantity and position of semicolons, apostrophes and special icons.
     *  - Managed brightness levels.
     *  - Display color change.
     */
    SevenSegDisplays(SevenSegDispHw* dspUndrlHwPtr);
    /**
     * @brief Virtual class destructor
     */
    ~SevenSegDisplays();
    /**
     * @brief Starts and initializes the underlying hardware services needed to keep the display data visible and updated.
     *
     * Depending on the underlying hardware characteristics, several tasks and services might be configured and started.
     * As these activities are hardware-aware each **SevenSegDispHw** subclass must implement those initialization tasks in it's own begin() method.
     *
     * @return The value returned by the **SevenSegDispHw** subclass implementation of the begin() method
     * @retval true: the hardware related services could be started as needed
     * @retval false: the hardware related services could not be started as needed
     */
    virtual bool begin();
    /**
     * @brief Makes the displayed contents blink, by turning periodically off and then turning on the display ports.
     *
     * Once started the display will continue blinking even if the contents are changed. By default all the digits are set to blink, but each digit might be configured individually to blink or not by using the setBlinkMask(const bool*) method. When invoking this method with no parameters the existing blinking times parameters -stating the time the blinking ports will stay off an then the time they will stay on- will be used. The blinking times are set at instantiation time to generate a symmetrical blinking effect, meaning that the time the display shows the contents and the time the display is blank are equal.
     *  The display blinks until a noBlink() method is invoked, or until a wait() is invoked, as **blinking** and **waiting** are mutually exclusive states.
     * The blinking rate can be changed by using the setBlinkRate(const unsigned long, const unsigned long) method. After changing the blinking rate, the new blinking rate will be kept until it is modified with a new setBlinkRate(const unsigned long, const unsigned long) call, or it is restarted by a blink(const unsigned long, const unsigned long) with parameters.
     * @note To restart the blinking with a blink() method invocation the service must first be stopped, as the blink() method call has no effect if the blinking service was already running.
     *
     * @retval true: If the display was not already set to blink and the blinking was successfully started, or if it was already running.
     * @retval false: The display could not be set for blink due to errors setting the timer that controls the blinking effect.
     */
    bool blink();
    /**
     * @brief Makes the displayed contents blink using the times passed as parameters.
     *
     * This blink() method implementation first calls the setBlinkRate(const unsigned long, const unsigned long) method for setting the time parameters. If the time parameters update succeed, a blink() -no parameters- is invoked afterwards.
     *
     * @param onRate Time (in milliseconds) the display must stay on, the value must be in the range minBlinkRate <= onRate <= maxBlinkRate. Those preset values can be known by the use of the getMinBlinkRate() and the getMaxBlinkRate() methods.
     * @param offRate (Optional) Time (in milliseconds) the display must stay off, the value must be in the range minBlinkRate <= offRate <= maxBlinkRate. Those preset values might be known by the use of the getMinBlinkRate() and the getMaxBlinkRate() methods. If no offRate value is provided the method will assume it's a symmetric blink call and use a value for offRate equal to the value passed for onRate.
     *
     * @retval true: The conditions to start blinking with the passed parameters were met, so the blinking starts.
     * @retval false: The conditions to start blinking with the passed parameters were **NOT** met, no changes could be made to the blinking state.Those conditions include:
     * - One or more of the parameters passed was out of range. The blinking won't be started.
     * - The blink() invocation failed as described in the method (timer activation failure).
     */
    bool blink(const unsigned long &onRate, const unsigned long &offRate = 0);
    /**
     * @brief Clears the display, turning off all the segments and dots.
     *
     * @note The clear() method can be invoked while the display is in "blinking state" or "waiting state". In the first case the effect will be not visible, as it will imply a empty display turning on and off, no visual clue will be perceived. In the second case, after the "wait state" ends the original display will not be restored as usual, but an empty display will be set after the noWait() is invoked.
     *
     * @note The clearing process involves writing a **space** character to every display port. Due to physical display characteristics this might be or not be equal to writing a '\0' to them.
     */
    void clear();
    /**
     * @brief Displays a basic graphical representation of the level of fulfillment or completeness of **two** segmented values or tasks.
     *
     *  The display gives a general fast notion on the matter, as a battery charge level, liquids deposit level, time remaining, tasks completeness and so on. The levels are represented by the horizontal segments (0, 1, 2 or 3 from bottom to top), and a character that might be added before each of the graphical representations to give an indication of what the display is showing. As four digit ports must be used, this method only applies to displays with 4 or more digits.
     *  The display is splitted in two sectors, the left side and the right side, and each one of them must have a valid value (0 <= value <= 3) to enable them to be displayed, and might have (or not) a single displayable character to give a visual hint to what the value is showing.
     *  For more information see the gauge(const int, char) method.
     *
     * @param levelLeft The value to display for the two left side 7 segments display ports, must be in the range 0 <= level <= 3.
     * @param levelRight The value to display for the two right side 7 segments display ports, must be in the range 0 <= level <= 3.
     * @param labelLeft (Optional) A char that will be displayed in the leftmost port of the display. The character must be one of the "displayable" characters, as listed in the **print(std::string)** method description. If not specified the default value, a **space**, will be assumed,
     * @param labelRight (Optional) A char that will be displayed in the position left to the **levelRight** display port of the display. The character must be one of the "displayable" characters, as listed in the **print(std::string)** method description. If not specified the default value, a **space**, will be assumed,
     *
     * @retval true: The values could be represented.
     * @retval false: The values couldn't be represented, being that the **levelLeft** and/or **levelRight** parameter was out of range and/or the **labelLeft** and/or **labelRight** parameter was not in the list of displayable characters. The display will be blanked.
     */
    bool doubleGauge(const int &levelLeft, const int &levelRight, char labelLeft = ' ', char labelRight = ' ');
    /**
     * @brief Stops and ends the underlying hardware services needed to keep the display data updated and visible
     *
     * Depending on the underlying hardware several tasks and services were configured and started by the **begin()** method.
     * As those configuration activities are hardware-aware each **SevenSegDispHw** subclass implement those initialization tasks, and each subclass must implement the correct termination of those tasks and services if required.
     * The **end()** method invokes the underlying hardware **end()** method
     *
     * @return The value returned by the **SevenSegDispHw** subclass implementation of the end() method
     * @retval true: the hardware related services could be stopped and ended as needed
     * @retval false: the hardware related services could not be stopped or ended as needed
     */
    virtual bool end();
    /**
     * @brief Displays a basic graphical representation of the level of fulfillment or completeness of a segmented value or task.
     *
     * The display gives a general fast notion on the matter, as a battery charge level, liquids deposit level, time remaining, tasks completeness and so on. The levels are represented by the horizontal segments (0, 1, 2 or 3 from bottom to top, and from left to right), and a character might be added before -leftmost port- the graphical representation to give an indication of what the display is showing. This method is usable in displays which have from 4 digits and up, as the representation makes use of 4 digits.
     *
     * @param level The integer value to display, must be in the range 0 <= level <= 3.
     * @param label (Optional) A character that might be added before (leftmost port) the graphical representation to give an indication of what the display is showing, if not specified the default value, a space, will be assumed. The character must be one of the "displayable" characters, as listed in the print(std::string) method description.
     *
     * @return The success in the display of the intended value.
     * @retval true: The value could be represented.
     * @retval false: The value couldn't be represented, being that:
     * - The **level** parameter was out of range
     * - The **label** parameter was not in the list of displayable characters.
     * The display will be blanked.
     */
    bool gauge(const int &level, char label = ' ');
    /**
     * @brief Displays a basic graphical representation of the level of fulfillment or completeness of a segmented value or task.
     *
     * See gauge(const int, char) for details
     *
     * @param level The double value to display, must be in the range 0.0 <= level <= 1.0, being the range the representation of the percentage of the 'full' level, so that the ranges are:
	  * 0.0 <= level < 0.25 for the first level,
	  * 0.25 <= level < 0.50 for the second level,
	  * 0.50 <= level < 0.75 for the third level, and
	  * 0.75 <= level <= 1.00 for the fourth and upper level.
     * @param label (Optional) A character that might be added before (leftmost port) the graphical representation to give an indication of what the display is showing, if not specified the default value, a space, will be assumed. The character must be one of the "displayable" characters, as listed in the print(std::string) method description.
     *
     * @return The success in the display of the intended value.
     * @retval true: The value could be represented.
     * @retval false: The value couldn't be represented, being that:
     * - The **level** parameter was out of range
     * - The **label** parameter was not in the list of displayable characters.
     * The display will be blanked.
     */
    bool gauge(const double &level, char label = ' ');
    /**
     * @brief Gets the quantity of ports -digits- of the display as informed by the underlying hardware (**UHW**)
     *
     * The object instantiation requires a **underlying physical display object** as parameter, and such information is requested from that object. Each time this class is instantiated the object is created with the needed resources -display memory buffer, auxiliary buffers, blinking mask, etc.), and the range of values displayable are calculated based on the display's ports quantity parameter, and that value is the one returned by this method.
     *
     * @return The number indicating the quantity of digits of the instantiated display.
     */
    uint8_t getDigitsQty();
    /**
     * @brief Gets the maximum integer number value displayable by the display.
     *
     * The value is calculated according to the quantity of digits -ports- the display has as retrieved from the underlying hardware (**UHW**) at the object instantiation.
     *
     * @return The greatest integer value display capability.
     */
    int32_t getDspValMax();
    /**
     * @brief Gets the minimum integer number value displayable by the display.
     *
     * The value is calculated according to the quantity of digits -ports- the display has as retrieved from the underlying hardware (**UHW**) at the object instantiation.
     *
     * @return The smallest integer value display capability.
     *
     * @note The use of one port to represent the **-** (minus) sign is considered in the value calculation.
     */
    int32_t getDspValMin();
    /**
     * @brief Gets the instantiation number it was given to the object.
     *
     * Each time the class is instantiated the created object receives a serial instantiation number that can be used in order to easily identify each object in case of need.
     *
     * @return The instantiation serial number of the object.
     */
    uint16_t getInstanceNbr();
    /**
     * @brief Gets the maximum value the blink rates for the blink() method might take.
     *
     * The speed at witch the physical displays might be turned on and off is limited. In the case of this parameter a too high value might void the blinking strobe effect of being perceived, giving the sensation that the display is fixed on, or was cleared from values. So a higher limit is imposed.
     *
     * @return The maximum value that might be used as a blink() function parameter.
     *
     * @note This value is also the maximum parameter accepted by the following methods: blink(const unsigned long, const unsigned long), setBlinkRate(const unsigned long, const unsigned long), wait(const unsigned long) and setWaitRate(const unsigned long)
     */
    unsigned long getMaxBlinkRate();
    /**
     * @brief Gets the minimum value the blink rates for the blink() method might take
     *
     * The speed at witch the physical displays might be turned on and off are limited. In the case of this parameter a too low value might avoid the blinking strobe effect of being perceived, or be not tolerated by the underlying hardware, giving the sensation that the display is fixed on, or was cleared from values. So a lower limit is imposed.
     *
     * @return The minimum value that might be used as a blink() function parameter.
     *
     * @note This value is also the minimum parameter accepted by the following methods: blink(const unsigned long, const unsigned long), setBlinkRate(const unsigned long, const unsigned long), wait(const unsigned long) and setWaitRate(const unsigned long)     */
    unsigned long getMinBlinkRate();
    /**
     * @brief Returns a value indicating if the display is blank
     *
     * @retval true: all the display ports hold a **space** value.
     * @retval false: at least one of the display ports hold a value different to a **space** value.
     *
     * @note The condition to be blank is that all the display ports are exhibiting the "space" character, not to be confused with '\0'
    */
    bool isBlank();
    /**
     * @brief Gets if the display is in **blinking mode**.
     *
     * @retval true: The display is set to blink.
     * @retval false: The display is set to not blink.
     *
     */
    bool isBlinking();
    /**
     * @brief Gets if the display is in **waiting mode**.
     *
     * @retval true: The display is set in waiting mode.
     * @retval false: The display is not set in waiting mode.
     */
    bool isWaiting();
    /**
     * @brief Stops the display blinking, if it was doing so, leaving the display turned on.
     *
     * @retval true: The display is set not to blink.
     * @retval false: The display was set to blink but the blinking couldn't be stopped due to timer management failures.
     * @warning The failure of the method might indicate a bug in the development. Direct manipulation of the handles and pointers to the resources (or the resources themselves) used by the blinking mechanism might disable this method capabilities to correctly exiting the **blinking state**
     */
    bool noBlink();
    /**
     * @brief Stops the **waiting mode** in process, if the display was in it.
     *
     * @retval true: The display is set out of **waiting mode**, and the waiting is stopped.
     * @retval false: The display was set to wait, but the waiting couldn't be stopped due to timer management failures.
     *
     * @warning The failure of the method might indicate a bug in the development. Direct manipulation of the handles and pointers to the resources (or the resources themselves) used by the waiting mechanism might disable this method capabilities to correctly exiting the **waiting state**
      */
    bool noWait();
    /**
     * @brief Displays a string.
     *
     * Displays the string text if it contains all **displayable** characters, which are the ones included in the following list: **0123456789AabCcdEeFGHhIiJLlnOoPqrStUuY-_.** and the **space**.
     * There are other 3 characters that can be represented in the display, but the conversion from a character to use while programming is "host language setting dependent", so those where assigned to available ASCII non displayable characters of easy access in any keyboard layout in most languages, they can be used as part of the text string to display, and they are:
     *
