GabyGold67/SevenSegDisplays_STM32/src/sevenSegDisplays.h
     * = Builds a character formed by lighting the lower 2 horizontal segments of the digit display, can be described as a "lower equal" symbol.
     *
     * ~ Builds a character formed by lighting the 3 horizontal segments of the digit display, can be described as an "equivalent" symbol.
     *
     * _*_ (asterisk) Builds a character by lighting the upper 4 segments, forming a little square, can be described as the "degrees" symbol or º.
     *
     * @param text String, up to **DigitsQty** -see getDigitsQty()- displayable characters long PLUS usable dots, all characters included in the representable characters list. Each valid character might be followed by a "." if needed, without being counted as a character, even spaces and special chars. If two or more consecutive dots are passed, an intermediate space is considered to be included between each pair of them, and that space counts as one of the available characters to display.
     *
     * @retval true: The text could be represented.
     * @retval false: The text couldn't be represented, and the display will be blanked.
     *
     * @note Several reasons might be causing a string to not display, including:
     * - The inclusion of a character not part of the **displayable list**.
     * - The text is longer than the object's DigitsQty (dots are not included in the count).
     * - The use of two or more consecutive "." -dots- which implies the addition of a space between them, and failing to take them into the account of the text length.
     *
     * @note If a print(std::string) method is invoked when the display is in **wait mode**, the method will end the **wait mode** by invoking a noWait() method.
     */
    bool print(std::string text);
    /**
     * @brief Displays an integer value.
     *
     *  The value will be displayed as long as the length of the representation fits the available digits of the display
     *
     * @param value The integer value to display which must be in the range (-1)*(pow(10, (dspDigits - 1)) - 1) <= value <= (pow(10, dspDigits) - 1)
     * @param rgtAlgn (Optional, if not specified the default value, **false**, will be assumed) Indicates if the represented value must be displayed right aligned, with the unneeded heading characters being completed with spaces or zeros, depending in the **zeroPad** optional parameter. When a negative value is displayed and it's less than (dspDigits - 1) digits long, a right aligned display will keep the '-' sign in the leftmost position, and the free space to the leftmost digit will be filled with spaces or zeros, depending in the **zeroPad** optional parameter.
     * @param zeroPad (Optional, if not specified the default value, false, will be assumed) indicates if the heading free spaces of the integer right aligned displayed must be filled with zeros (true) or spaces (false). In the case of a negative integer the spaces or zeros will fill the gap between the '-' sign kept in the leftmost position, and the first digit.
     *
     * @retval true: The value could be represented.
     * @retval false: The value couldn't be represented, and the display will be blanked.
     *
     */
    bool print(const int32_t &value, bool rgtAlgn = false, bool zeroPad = false);
    /**
     * @brief Displays a floating point value.
     *
     * The value will be displayed as long as the length representation fits the available space of the display. If the integer part of value is not in the displayable range or if the sum of the spaces needed by the integer part plus the indicated decimal places to display is greater than the available digits space, the method will fail.
     *
     * @param value The floating point value to display, which must be in the range ((-1)*(pow(10, ((dspDigits - decPlaces) - 1)) - 1)) <= value <= (pow(10, (dspDigits - decPlaces)) - 1).
     * @param decPlaces Decimal places to be displayed after the decimal point, ranging 0 <= decPlaces < dspDigits, selecting 0 value will display the number as an integer, with no '.' displayed. In any case the only modification that will be applied if value has a decimal part longer than the decPlaces number of digits is **truncation**, if any other rounding criteria is desired the developer must apply it to **value** before calling this method.
     * @param rgtAlgn Right alignement, see print(const int32_t, bool, bool)
     * @param zeroPad Zero padding, see print(const int32_t, bool, bool)
     *
     * @retval true: The value could be represented.
     * @retval false: The value couldn't be represented, and the display will be blanked.
     */
    bool print(const double &value, const unsigned int &decPlaces, bool rgtAlgn = false, bool zeroPad = false);
    /**
     * @brief Resets the blinking mask.
     *
     * The blinking mask configures which digits of the display will be affected by the blink() method, resetting the mask will restore the original setting by which all the ports of the display will be affected when **blinking mode** is active.
     */
    void resetBlinkMask();
    /**
     * @brief Modifies the blinking mask.
     *
     * The blinking mask indicates which digits will be involved after a blink() method is invoked. Indicating true for a digit makes it blink when the method is called, indicating false makes it display steady independently of the others. The parameter is positional referenced to the display, and for ease of use the index numbers of the parameter array indicate their position relative to the rightmost digit (blnkPort0). The mask might be reset to its original value (all digits set to blink) by using this method with all array's elements set to **true** or by using the resetBlinkMask() method.
     *
     * @param newBlnkMsk A pointer to a boolean array the size of DigitsQty long, the first element of the array corresponding to the leftmost display port, the following element representing the next display port to it's left. A true value in the array element will set the corresponding display port to blink when the blink() methods are invoked, a false will make it's displayed value steady.
     */
    void setBlinkMask(const bool* newBlnkMsk);
    /**
     * @brief Changes the time parameters to use for the display blinking the contents it shows.
     *
     * The parameters change will take immediate effect, either if the display is already blinking or not, in the latter case the parameters will be the ones used when a blink() method is called without parameters. The blinking will be **symmetrical** if only one parameter is passed, **asymmetrical** if two different parameters are passed, meaning that the time the display shows the contents and the time the display is blank will be equal (symmetrical) or not (asymmetrical), depending of those two parameters. The blink rate set will be kept after a `noBlink()` or new `blink()` without parameters call is done, until it is modified with a new `setBlinkRate()` call, or it is restarted by a `blink()` with parameters.
     *
     * @note To restart the blinking with a `blink()` the service must first be stopped, as the method makes no changes if the blinking service was already running.
     *
     * @param newOnRate Contains the time (in milliseconds) the display must stay on, the value must be in the range minBlinkRate <= onRate <= maxBlinkRate. Those built-in values can be known by the use of the `getMinBlinkRate()` and the `getMaxBlinkRate()` methods.
     * @param newOffRate (Optional) Contains the time (in milliseconds) the display must stay off, the value must be in the range minBlinkRate <= offRate <= maxBlinkRate. Those built-in values can be known by the use of the `getMinBlinkRate()` and the `getMaxBlinkRate()` methods. If no offRate value is provided the method will assume it's a symmetric blink call and use a value of offRate equal to the value passed by onRate.
     *
     * @retval true: If the parameter or parameters passed are within the valid range, and the change will take effect immediately.
	  * @retval false: One or more of the parameters passed were out of range. The rate change would not be made for none of the parameters.
     *
     */
    bool setBlinkRate(const unsigned long &newOnRate, const unsigned long &newOffRate = 0);
    /**
     * @brief Sets the character to use when the display is in **wait mode**.
     *
     * The parameters change will take immediate effect, either if the display is already in wait mode or not. The new character will be changed for further calls of the method until a new setWaitChar() is invoked with a valid argument.
     *
     * @param newChar A character the display must use for symbolizing the progress, the value must be in the displayable characters list as explained in the print(std::string) method.
     *
     * @retval true: If the character passed is within the displayable characters range, and the change will take effect immediately.
     * @retval false: The parameter passed was invalid, i.e. it was a non displayable character. In this case the character change will fail.
     */
    bool setWaitChar(const char &newChar);
    /**
     * @brief Changes the time parameter to use for the display to show the "in-progress bar" advancement.
     *
     * The parameters change will take immediate effect, either if the display is already in wait mode or not, in the latter case the parameter will be used in the next `wait()` method call without parameters. The wait rate set will be kept until it is modified with a new `setWaitRate()` call, or it is restarted by a `wait(const unsigned long)` with parameters. Note that to restart the waiting with a `wait()` the service must first be stopped, as the method makes no changes if the waiting service was already running.
     *
     * @param newWaitRate The time (in milliseconds) the display must take to advance the next character symbolizing the progress, the value must be in the range minBlinkRate <= newWaitRate <= maxBlinkRate. (See `getMinBlinkRate()`and `getMaxBlinkRate()` methods).
     *
     * @retval true: The parameter passed is within the valid range, and the change takes immediate effect.
     * @retval false: The parameter passed is out of range, the rate change would not be made.
     *
     */
    bool setWaitRate(const unsigned long &newWaitRate);
    /**
     * @brief Makes the display show a "simple animated progress bar".
     *
     * The simple animation mechanism has as it's main purpose to show the final user the system is working and not in any "hang" situation. As in most O.S. progress bar animation, the sequence starts with  a blank display and a defined character is added from left to right at a configured pace, until all the ports are lit, starting over with the display blanking. The rate at which the characters are added and the character used for display are both configurable (see `setWaitChar(const char)` and setWaitRate(const unsigned long) for details).
     *
     * @retval true: The display was not in **waiting mode** and the required timer could be attached. The **waiting mode** is started.
     * @retval false: The display was in **waiting mode**, no change was made.
     * @retval false: The timer couldn't be attached, the display wasn't set to **wait mode**
     */
    bool wait();
    /**
     * @brief  Makes the display show a "simple animated progress bar".
     *
     * See `wait()` for details.
     *
     * @param newWaitRate The time (in milliseconds) the display must take to advance the next character symbolizing the progress, the value must be in the range minBlinkRate <= newWaitRate <= maxBlinkRate. (See `getMinBlinkRate()`and `getMaxBlinkRate()` methods).
     * @retval true: The display was not in **waiting mode** and the required timer could be attached. The **waiting mode** is started.
     * @retval false: The display was in **waiting mode**, no change was made.
     * @retval false: The parameter passed is out of range, the display wasn't set to **wait mode**
     * @retval false: The timer couldn't be attached, the display wasn't set to **wait mode**
     */
    bool wait(const unsigned long &newWaitRate);
    /**
     * @brief Prints one character to the display, at a defined port, without affecting the rest of the characters displayed.
     *
     * @param segments An integer value representing which segments to turn on and which off to get the graphic representation of a character in the seven segment display.
     * @param port An integer value representing the digit where the character will be set, being the range of valid values 0 <= port < dspDigits, the 0 value is the rightmost port, the 1 value the second from the right and so on.
     * @retval true: The parameters are within the acceptable range, in this case 0 <= port < dspDigits.
     * @retval false: The port value was outside the acceptable range.
     *
     * @note The corresponding value can be looked up in the **_charLeds[]** array definition in the header file of the library. In the case of a common cathode display the values there listed must be complemented. Any other uint8_t (char or unsigned short int is the same here) value is admissible, but the displayed result might not be easily recognized as a known ASCII character, but might be useful to display pre-defined special **pre-defined significance** characters.
     */
    bool write(const uint8_t &segments, const uint8_t &port);
    /**
     * @brief Prints one character to the display, at a defined port, without affecting the rest of the characters displayed.
     *
     * @param character A single character string that must be displayable, as defined in the `print()` method.
     * @param port An integer value representing the digit where the character will be set, being the range of valid values 0 <= port <= (dspDigits - 1), the 0 value is the rightmost digit, the 1 value the second from the right and so on.
     *
     * @retval true:**character** is a displayable one char string, and **port** value is in the range 0 <= value <= (dspDigits - 1).
     * @retval: false: The **character** was not "displayable" or the **port** value was out of range.
     *
     */
    bool write(const std::string &character, const uint8_t &port);
};

//============================================================> Class declarations separator

/**
 * @brief Models Click Counter (a.k.a. Tally Counter) class objects.
 *
 * The class implements a Click Counter, a device with the main purpose of incrementing a count by one every time a pushbutton or lever is pressed. The devices have a long story, passing from purely mechanical, to electro mechanical to electronic implementations. This implementation adds several improvements and extensions to the basic services provided by the mechanical counterparts, and uses a SevenSegDisplay class object to show the count status.
 *
 * @class ClickCounter
 */
class ClickCounter{
private:
    SevenSegDisplays* _displayPtr;
    bool _countRghtAlgn;
    bool _countZeroPad;
protected:
    int32_t _beginStartVal{0};
    int32_t _count{0};
public:
    /**
     * @brief
     *
     * @param newDisplay A pointer to a SevenSegDisplays class object which will display the counter current count value.
     * @param rghtAlgn (Optional) Establishes if the numbers will be displayed right aligned (true) or left aligned (false). Default value is true. For more details see SevenSegDisplays::print(const int32_t, bool, bool)
     * @param zeroPad (Optional) Establishes if the numbers when displayed right aligned, if the digits are less than the display ports, will be completed with heading spaces or 0s. For more details see SevenSegDisplays::print(const int32_t, bool, bool)
     */
    ClickCounter(SevenSegDisplays* newDisplay, bool rghtAlgn = true, bool zeroPad = false);
    /**
     * @brief Class destructor
     *
     * @attention The ClickCounter class destructor **does not call** the SevenSegDisplays destructor method. As the ClickCounter object was instantiated with the provision of a pointer to an SevenSegDisplays object, the logical path is for the code calling this destructor to dispose of the SevenSegDisplays object according to it's plans.
     */
    ~ClickCounter();
    /**
     * @brief See SevenSegDisplays::blink()
     */
    bool blink();
    /**
     * @brief See SevenSegDisplays::blink(const unsigned long, const unsigned long)
     */
    bool blink(const unsigned long &onRate, const unsigned long &offRate = 0);
    /**
     * @brief See SevenSegDisplays::clear()
     */
    void clear();
    /**
     * @brief Initiates the counter operation.
     *
     * The counter initiation involves several actions including:
     * - Beginning the seven segments display operation, including the underlying hardware display
     * - Checking the starting value is within the valid range
     * - Saving the starting value for future reference
     *
     * @param startVal (optional) The starting value setting for the counter, it must be in the range _displayPtr->getDspValMin() <= startVal <= _displayPtr->getDspValMax(). If no value is specified the default value 0 will be assumed.
     *
     * @return The success initiating the counter.
     * @retval true: The initiation succeeded.
     * @retval false: The initiation failed, either caused by a fail initializing the SevenSegDisplay object or caused by a startVal out of range.
     */
    bool countBegin(int32_t startVal = 0);
    /**
     * @brief Decrements the counter value.
     *
     * Decrements the value of the current count and refreshes the display to keep it updated. The counter **is decremented** independently of the sign of the current count, as long as the new value resulting is in the displayable range.
     *
     * @param qty (Optional) The integer whose **absolute value** is to be decremented from the current count. If a parameter is not provided a value of 1 is assumed.
     *
     * @return The success in decrementing the parameter value from the counter
     * @retval true: The result of subtracting the **absolute value** of parameter from the counter was within the valid range, counter updated.
     * @retval false: The counter modification failed.Either the parameter value was 0, or the result of subtracting **absolute value** of the parameter from the counter was out of the valid range, counter was not updated, i.e. (count - abs(qty)) < _displayPtr->getDspValMin().
     */
    bool countDown(int32_t qty = 1);
    /**
     * @brief Returns the counter count value to that of the parameter used in the countBegin(int32_t) method
     *
     * @return The success in returning the count to it's original value.
     */
    bool countReset();
    /**
     * @brief Changes the current count value without stopping and restarting the ClickCounter.
     *
     * The count value will be set to the parameter value passed if it's within valid range.
     *
     * @param restartVal (Optional) New value for the counter count attribute. If a parameter is not provided a value of 0 is assumed.
     *
     * @return The success restarting the counter
     * @retval true: The restarting succeeded.
     * @retval false: The restarting failed, caused by a restartVal out of acceptable range.     */
    bool countRestart(int32_t restartVal = 0);
    /**
     * @brief Clears the display and stops the SevenSegDisplays object.
     *
     * The display is cleared -see clear()- and the SevenSegDisplays object working is stopped by sending a SevenSegDisplays::end(), but it is not destructed. The object might be restarted by using the CountBegin(uint32_t) method.
     *
     * @return The value returned by the SevenSegDisplays::end()
     */
    bool countEnd();
    /**
     * @brief Modifies the value of the current count by the adding or subtracting the parameter value passed to make the count absolute value smaller until it reaches zero.
     *
     * Modifies the value of the current count. The counter absolute value will be decremented, independently of the sign of the current count, as long as the absolute value of the modification is less than or equal to the current value. If the current count is negative, the absolute value of the parameter will be added, and so result in a count value increment. If the current count is positive, the absolute value of the parameter will be subtracted, resulting in a count decrement, with the concrete purpose of approaching the count value to 0.
     *
     * @param qty  (Optional) The unsigned integer value to add or subtract from the current count. If a parameter is not provided a value of 1 is assumed.
     *
     * @return The success in subtracting the absolute value of the parameter from the absolute value of the counter.
     * @retval true: The result of the operation value from the counter was within the valid range, counter updated.
     * @retval false: Either the parameter value was 0, or the result of subtracting the absolute value of the parameter from the absolute value of the counter resulted in less than 0, counter was not updated.
     */
    bool countToZero(int32_t qty = 1);
    /**
     * @brief Increments the counter value.
     *
     * Increments the value of the current count and refreshes the display to keep it updated. The counter **is incremented** independently of the sign of the current count, as long as the new value resulting is in the displayable range.
     *
     * @param qty (Optional) The integer whose **absolute value** is to be incremented to the current count. If a parameter is not provided a value of 1 is assumed.
     *
     * @return The success in incrementing the parameter value from the counter
     * @retval true: The result of adding the **absolute value** of parameter to the counter was within the valid range, counter updated.
     * @retval false: The counter modification failed.Either the parameter value was 0 (not accepted value), or the result of adding the **absolute value** of the parameter to the counter was out of the valid range, counter was not updated, i.e. (count + abs(qty)) > _displayPtr->getDspValMax().
     */
    bool countUp(int32_t qty = 1);
    /**
     * @brief Gets the current value of the counter.
     *
     * @return The current value held by the counter.
     */
    int32_t getCount();
    /**
     * @brief Gets the value used to start the counter.
     *
     * Gets the value passed as parameter when the countBegin(int32_t) method was invoked, starting the counter. This is the value that will be used for the countReset() method.
     *
     * @return The value to which the counter was originally started.
     */
    int32_t getStartVal();
    /**
     * @brief See SevenSegDisplays::noBlink()
     */
    bool noBlink();
    /**
     * @brief See SevenSegDisplays::setBlinkRate(const unsigned long, const unsigned long)
     */
    bool setBlinkRate(const unsigned long &newOnRate, const unsigned long &newOffRate = 0);
    /**
     * @brief Sends the current count value to the SevenSegDisplay
     *
     * The information sent to the SevenSegDisplays object includes the alignment and padding settings
     *
     * @return The value returned by the SevenSegDisplays::print(const int32_t, bool, bool) method invoked.
     */
    bool updDisplay();
};

//============================================================> Class declarations separator

#endif /* _SEVENSEGDISPLAYS_STM32_H_ */
